<a href="https://colab.research.google.com/github/HIsu1231/AI_INOVATION_SQUARE/blob/master/Kaggle_Titanic__Data_preprocessing_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd
import numpy as np

###pd.read_csv() 실행

In [24]:
train_df = pd.read_csv('./drive/MyDrive/AI_INOVATION_SQUARE/data/titanic_data/train.csv')
test_df = pd.read_csv('./drive/MyDrive/AI_INOVATION_SQUARE/data/titanic_data/test.csv')
test_sub_df = pd.read_csv('./drive/MyDrive/AI_INOVATION_SQUARE/data/titanic_data/gender_submission.csv')

###DataFrame 확인

In [25]:
train_df.head()

#PassengerId : 승객 번호
#Survived : 생존 여부
#Pclass : 승선권 클래스(1st, 2nd, 3rd)
#Name : 승객 이름
#Sex : 승객 성별
#Age : 승객 나이
#SibSp : 동반한 형재자매, 배우자 수
#Parch : 동반한 부모, 자식 수
#Ticket : 티켓의 고유 번호
#Fare : 티켓의 요금
#Cabin : 객실 번호
#Embarked : 승선한 항구명 (C: Cherbourg, Q: Queenstown, S: Southampton)

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [26]:
test_df.head()

   PassengerId  Pclass  ... Cabin Embarked
0          892       3  ...   NaN        Q
1          893       3  ...   NaN        S
2          894       2  ...   NaN        Q
3          895       3  ...   NaN        S
4          896       3  ...   NaN        S

[5 rows x 11 columns]

In [27]:
test_sub_df.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

###train 데이터의 missing data 처리

In [28]:
train_df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [29]:
train_df['Age'].value_counts()

24.00    30
22.00    27
18.00    26
19.00    25
30.00    25
         ..
55.50     1
70.50     1
66.00     1
23.50     1
0.42      1
Name: Age, Length: 88, dtype: int64

In [30]:
train_df['Embarked'].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [31]:
#NaN값 나이의 중앙 값으로 대체
train_df['Age'].fillna(train_df['Age'].median(), inplace=True)

#NaN값 가장 빈도수가 많은 'S'로 대체
train_df['Embarked'].fillna('S', inplace=True)

In [32]:
#나머지 컬럼은 학습에 중요하지 않기때문에 변경하지 않음
train_df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         0
dtype: int64

###test 데이터의 missing 데이터 처리

In [33]:
test_df.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [34]:
test_df['Age'].value_counts

<bound method IndexOpsMixin.value_counts of 0      34.5
1      47.0
2      62.0
3      27.0
4      22.0
       ...
413     NaN
414    39.0
415    38.5
416     NaN
417     NaN
Name: Age, Length: 418, dtype: float64>

In [35]:
test_df['Fare'].value_counts

<bound method IndexOpsMixin.value_counts of 0        7.8292
1        7.0000
2        9.6875
3        8.6625
4       12.2875
         ...
413      8.0500
414    108.9000
415      7.2500
416      8.0500
417     22.3583
Name: Fare, Length: 418, dtype: float64>

In [36]:
#NaN값 나이의 중앙 값으로 대체
test_df['Age'].fillna(test_df['Age'].median(), inplace=True)

#NaN값 요금의 평균 값으로 대체
test_df['Fare'].fillna(test_df['Fare'].mean(), inplace=True)

#나머지 컬럼은 학습에 중요하지 않기 때문에 NaN값 변경하지 않음 
train_df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         0
dtype: int64

###딥러닝 학습을 위한 matrix 생성

In [38]:
train_csv_data = train_df.values
test_csv_data = test_df.values
test_csv_sub = test_sub_df.values

print(type(train_csv_data), train_csv_data.shape)
print(type(test_csv_data), test_csv_data.shape)
print(type(test_csv_sub), test_csv_sub.shape)

<class 'numpy.ndarray'> (891, 12)
<class 'numpy.ndarray'> (418, 11)
<class 'numpy.ndarray'> (418, 2)

###Data Conversion(문자 -> 숫자)

In [39]:
#train_csv_data에서 Sex male -> 1, female -> 0

for i in range(len(train_csv_data)):
  
    if train_csv_data[i,4] == 'male':
        train_csv_data[i,4] = 1
    else:
        train_csv_data[i,4] = 0

#test_csv_data에서 Sex male -> 1, female -> 0

for i in range(len(test_csv_data)):

    if test_csv_data[i,3] == 'male':
        test_csv_data[i,3] = 1
    else:
        test_csv_data[i,3] = 0

In [41]:
train_df['Embarked'].value_counts()

S    646
C    168
Q     77
Name: Embarked, dtype: int64

In [43]:
#train_csv_data에서 Embared Empty -> 0, S -> 1, C -> 2, Q -> 3

for i in range(len(train_csv_data)):
    if train_csv_data[i,11] == 'S':
        train_csv_data[i,11] = 1
    
    elif train_csv_data[i,11] == 'C':
        train_csv_data[i,11] = 2
    
    elif train_csv_data[i,11] == 'Q':
        train_csv_data[i,11] = 3

#test_csv_data에서 Embared Empty -> 0, S -> 1, C -> 2, Q -> 3
    
for i in range(len(test_csv_data)):
    if test_csv_data[i,10] == 'S':
        test_csv_data[i,10] = 1
      
    elif test_csv_data[i,10] == 'C':
        test_csv_data[i,10] = 2
    
    elif test_csv_data[i,10] == 'Q':
        test_csv_data[i,10] = 3

###training data 생성

In [45]:
train_df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [48]:
#사용할 컬럼 Pclass, Sex, Age, SibSp, Parch, Fare
training_input_data = train_csv_data[:, [2, 4, 5, 6, 7, 9]].astype('float32')

#Sruvived
training_target_data = train_csv_data[:, 1:2].astype('float32')

print("training_input_data.shape = ", training_input_data.shape,", training_target_data.shape = ", training_target_data.shape)

training_input_data.shape =  (891, 6) , training_target_data.shape =  (891, 1)

In [49]:
print(training_input_data[0])

[ 3.    1.   22.    1.    0.    7.25]

###test data 생성

In [50]:
test_df.head()

   PassengerId  Pclass  ... Cabin Embarked
0          892       3  ...   NaN        Q
1          893       3  ...   NaN        S
2          894       2  ...   NaN        Q
3          895       3  ...   NaN        S
4          896       3  ...   NaN        S

[5 rows x 11 columns]

In [52]:
test_sub_df.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

In [56]:
test_input_data = test_csv_data[:,[1,3,4,5,6,8]].astype('float32')
test_target_data = test_csv_sub[:,-1].astype('float32')

print("test_input_data.shape = ", test_input_data.shape,", test_target_data.shape = ",test_target_data.shape)

test_input_data.shape =  (418, 6) , test_target_data.shape =  (418,)